IRP/src/Catalogs/AddAttributeAndPropertySets/AddAttributeAndPropertySets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AddAttributeAndPropertySets</name>
  <predefined>
    <items>
      <name>Catalog_ItemKeys</name>
    </items>
    <items>
      <name>Catalog_Items</name>
    </items>
    <items>
      <name>Catalog_ItemTypes</name>
    </items>
    <items>
      <name>Document_SalesInvoice</name>
    </items>
    <items>
      <name>Catalog_Boxes</name>
      <description>Catalog boxes</description>
    </items>
    <items>
      <name>Catalog_Partners</name>
      <description>Catalog partners</description>
    </items>
    <items>
      <name>Catalog_ExpenseAndRevenueTypes</name>
      <description>Catalog expense and revenue types</description>
    </items>
    <items>
      <name>Catalog_BusinessUnits</name>
      <description>Catalog business units</description>
    </items>
    <items>
      <name>Catalog_PriceKeys</name>
      <description>Catalog price keys</description>
    </items>
    <items>
      <name>Document_SalesOrder</name>
      <description>Document sales order</description>
    </items>
    <items>
      <name>Catalog_ChequeBonds</name>
      <description>Cheque bonds</description>
    </items>
    <items>
      <name>Catalog_Specifications</name>
      <description>Catalog specifications</description>
    </items>
    <items>
      <name>Document_PurchaseInvoice</name>
      <description>Document purchase invoice</description>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
      <description>Document purchase order</description>
    </items>
  </predefined>
  <tabularSections>
    <name>Attributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>IsConditionSet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InterfaceGroup</name>
      <comment>Name of group for attribute</comment>
      <type>
        <types>CatalogRef.InterfaceGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Required</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>IsConditionSet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItemTypes</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.ItemTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AvailableAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>AffectPricing</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Required</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowInHTML</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/AddAttributeAndPropertySets/ManagerModule.bsl
Procedure SinhronizeItemKeysAttributes() Export
	Query = New Query();
	Query.Text =
		"SELECT
		|	ItemTypesAvailableAttributes.Attribute AS Attribute
		|FROM
		|	Catalog.ItemTypes.AvailableAttributes AS ItemTypesAvailableAttributes
		|WHERE
		|	NOT ItemTypesAvailableAttributes.Ref.DeletionMark
		|GROUP BY
		|	ItemTypesAvailableAttributes.Attribute";
	QueryResult = Query.Execute();
	ArrayOfAttributes = QueryResult.Unload().UnloadColumn("Attribute");
	SinhronizeAttributes(Catalogs.AddAttributeAndPropertySets.Catalog_ItemKeys, ArrayOfAttributes);
EndProcedure

Procedure SinhronizePriceKeysAttributes() Export
	Query = New Query();
	Query.Text =
		"SELECT
		|	ItemTypesAvailableAttributes.Attribute AS Attribute
		|FROM
		|	Catalog.ItemTypes.AvailableAttributes AS ItemTypesAvailableAttributes
		|WHERE
		|	NOT ItemTypesAvailableAttributes.Ref.DeletionMark
		|	AND ItemTypesAvailableAttributes.AffectPricing
		|GROUP BY
		|	ItemTypesAvailableAttributes.Attribute";
	QueryResult = Query.Execute();
	ArrayOfAttributes = QueryResult.Unload().UnloadColumn("Attribute");
	SinhronizeAttributes(Catalogs.AddAttributeAndPropertySets.Catalog_PriceKeys, ArrayOfAttributes);
EndProcedure

Procedure SinhronizeAttributes(Set, ArrayOfAttributes)
	If Not TransactionActive() Then
		BeginTransaction(DataLockControlMode.Managed);
		Try
			WriteDataToObject(Set, ArrayOfAttributes);
			If TransactionActive() Then
				CommitTransaction();
			EndIf;
		Except
			If TransactionActive() Then
				RollbackTransaction();
			EndIf;
		EndTry;
	Else
		WriteDataToObject(Set, ArrayOfAttributes);
	EndIf;
EndProcedure

Procedure WriteDataToObject(Set, ArrayOfAttributes)
	DataSource = New ValueTable();
	DataSource.Columns.Add("Ref", New TypeDescription("CatalogRef.AddAttributeAndPropertySets"));
	DataSource.Add().Ref = Set;
	
	DataLock = New DataLock();
	ItemLock = DataLock.Add("Catalog.AddAttributeAndPropertySets");
	ItemLock.Mode = DataLockMode.Exclusive;
	ItemLock.DataSource = DataSource;
	ItemLock.UseFromDataSource("Ref", "Ref");
	DataLock.Lock();
	
	CatalogObject = Set.GetObject();
	CatalogObject.Attributes.Clear();
	For Each Attribute In ArrayOfAttributes Do
		CatalogObject.Attributes.Add().Attribute = Attribute;
	EndDo;
	
	CatalogObject.Write();
EndProcedure
